In [1]:
import pandas as pd
import os
os.getcwd()
change="C:\\Users\\talib\\OneDrive\\Desktop"
os.chdir(change)
df=''
for file in os.listdir():
    if file.endswith(".csv"):
        df=pd.read_csv("sample_with_nan_values.csv")
df.info()

FileNotFoundError: [Errno 2] No such file or directory: 'sample_with_nan_values.csv'

In [ ]:
df.head()

In [6]:
df.tail()

      ID   Name   Age Department   Salary Joining_Date
195  196   Amit  21.0        NaN  25000.0   2020-07-14
196  197  Priya  22.0         HR      NaN   2020-07-15
197  198  Nisha  21.0         HR      NaN   2020-07-16
198  199   Amit  20.0         HR  40000.0   2020-07-17
199  200    NaN  24.0        NaN  30000.0   2020-07-18

In [7]:
df["Age"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 200 entries, 0 to 199
Series name: Age
Non-Null Count  Dtype
--------------  -----
166 non-null    float64
dtypes: float64(1)
memory usage: 1.7 KB

In [8]:
df.dtypes

ID                int64
Name             object
Age             float64
Department       object
Salary          float64
Joining_Date     object
dtype: object

In [9]:
df["Age"].astype("int8")

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [10]:
df.ndim

2

In [11]:
df["Age"].ndim

1

In [12]:
df.size

1200

In [13]:
df["Age"].size

200

In [14]:
df.shape

(200, 6)

In [15]:
df["Age"].shape

(200,)

In [16]:
df["Age"].array

<NumpyExtensionArray>
[np.float64(20.0),  np.float64(nan), np.float64(20.0), np.float64(25.0),
 np.float64(20.0), np.float64(21.0),  np.float64(nan),  np.float64(nan),
 np.float64(25.0), np.float64(21.0),
 ...
 np.float64(20.0), np.float64(22.0), np.float64(25.0), np.float64(24.0),
 np.float64(21.0), np.float64(21.0), np.float64(22.0), np.float64(21.0),
 np.float64(20.0), np.float64(24.0)]
Length: 200, dtype: float64

In [17]:
df.describe().head()

               ID         Age        Salary
count  200.000000  166.000000    152.000000
mean   100.500000   22.192771  32105.263158
std     57.879185    1.900289   5653.525999
min      1.000000   20.000000  25000.000000
25%     50.750000   20.000000  25000.000000

In [18]:
df.head()

   ID   Name   Age Department   Salary Joining_Date
0   1  Nisha  20.0        NaN  35000.0   2020-01-01
1   2    NaN   NaN         HR      NaN   2020-01-02
2   3   Amit  20.0         IT  35000.0   2020-01-03
3   4    NaN  25.0        NaN  35000.0   2020-01-04
4   5    NaN  20.0        NaN  30000.0   2020-01-05

In [21]:
df.isnull().sum()

ID               0
Name            64
Age             34
Department      92
Salary          48
Joining_Date     0
dtype: int64

In [24]:
df1=df["Age"]==20
df[df1].head()

    ID   Name   Age Department   Salary Joining_Date
0    1  Nisha  20.0        NaN  35000.0   2020-01-01
2    3   Amit  20.0         IT  35000.0   2020-01-03
4    5    NaN  20.0        NaN  30000.0   2020-01-05
11  12   Amit  20.0         HR      NaN   2020-01-12
13  14    NaN  20.0         IT  30000.0   2020-01-14

In [32]:
df2=df[(df["Age"]==20) &(df["Department"]=="IT")]
df2

      ID   Name   Age Department   Salary Joining_Date
2      3   Amit  20.0         IT  35000.0   2020-01-03
13    14    NaN  20.0         IT  30000.0   2020-01-14
59    60  Nisha  20.0         IT  30000.0   2020-02-29
114  115  Priya  20.0         IT  25000.0   2020-04-24
150  151    NaN  20.0         IT  35000.0   2020-05-30
163  164    NaN  20.0         IT  30000.0   2020-06-12
175  176  Priya  20.0         IT  25000.0   2020-06-24

In [36]:
df3=df[df["Joining_Date"]>"2020-06-24"]
df3["Name"].head()

176    Nisha
177      Raj
178      NaN
179      Raj
180      Raj
Name: Name, dtype: object

In [38]:
df3.head()

      ID   Name   Age Department   Salary Joining_Date
176  177  Nisha  21.0    Finance      NaN   2020-06-25
177  178    Raj  25.0        NaN      NaN   2020-06-26
178  179    NaN  21.0         IT  30000.0   2020-06-27
179  180    Raj  22.0        NaN  35000.0   2020-06-28
180  181    Raj  25.0        NaN  35000.0   2020-06-29

In [45]:
df4=df[df["Department"]=="Finance"]
df4["Name"]

8       Amit
12       NaN
21       Raj
33     Nisha
39     Nisha
41      Amit
63       NaN
66     Priya
90     Priya
99       NaN
103      Raj
108      Raj
109     Amit
112     Amit
116      Raj
123      NaN
125    Nisha
133     Amit
140    Priya
151      NaN
153      NaN
162      NaN
169    Nisha
170    Nisha
176    Nisha
181      Raj
185    Nisha
189      NaN
Name: Name, dtype: object

In [60]:
df5=df[df["Department"]=="IT"]
df5[["Name","Salary"]]

      Name   Salary
2     Amit  35000.0
6     Amit  25000.0
13     NaN  30000.0
18   Priya  30000.0
24     NaN  25000.0
40     Raj      NaN
48     Raj  25000.0
51   Priya      NaN
54   Priya  40000.0
56   Priya  25000.0
59   Nisha  30000.0
68   Priya      NaN
72   Priya  40000.0
80   Priya  25000.0
92   Priya  40000.0
97     NaN  25000.0
105  Nisha      NaN
106   Amit  40000.0
113    NaN      NaN
114  Priya  25000.0
126    NaN      NaN
134    Raj  30000.0
143    NaN  35000.0
146  Nisha      NaN
150    NaN  35000.0
152   Amit      NaN
156   Amit      NaN
159  Nisha  25000.0
161  Priya  30000.0
163    NaN  30000.0
164    Raj  30000.0
165    NaN  30000.0
167  Nisha  35000.0
171  Nisha  40000.0
175  Priya  25000.0
178    NaN  30000.0
187    Raj  35000.0
193    NaN  30000.0

In [63]:
df6=df[df["Department"]=="Finance"]
df6[["Name","Joining_Date"]]

      Name Joining_Date
8     Amit   2020-01-09
12     NaN   2020-01-13
21     Raj   2020-01-22
33   Nisha   2020-02-03
39   Nisha   2020-02-09
41    Amit   2020-02-11
63     NaN   2020-03-04
66   Priya   2020-03-07
90   Priya   2020-03-31
99     NaN   2020-04-09
103    Raj   2020-04-13
108    Raj   2020-04-18
109   Amit   2020-04-19
112   Amit   2020-04-22
116    Raj   2020-04-26
123    NaN   2020-05-03
125  Nisha   2020-05-05
133   Amit   2020-05-13
140  Priya   2020-05-20
151    NaN   2020-05-31
153    NaN   2020-06-02
162    NaN   2020-06-11
169  Nisha   2020-06-18
170  Nisha   2020-06-19
176  Nisha   2020-06-25
181    Raj   2020-06-30
185  Nisha   2020-07-04
189    NaN   2020-07-08

In [64]:
df.head()

   ID   Name   Age Department   Salary Joining_Date
0   1  Nisha  20.0        NaN  35000.0   2020-01-01
1   2    NaN   NaN         HR      NaN   2020-01-02
2   3   Amit  20.0         IT  35000.0   2020-01-03
3   4    NaN  25.0        NaN  35000.0   2020-01-04
4   5    NaN  20.0        NaN  30000.0   2020-01-05

In [65]:
df["Salary"].agg("max")

40000.0

In [66]:
df[["Salary","Age"]].agg("max")

Salary    40000.0
Age          25.0
dtype: float64

In [71]:
df[["Salary","Age"]].agg(["max","min","sum","mean"])

            Salary          Age
max   4.000000e+04    25.000000
min   2.500000e+04    20.000000
sum   4.880000e+06  3684.000000
mean  3.210526e+04    22.192771

In [72]:
df.head()

   ID   Name   Age Department   Salary Joining_Date
0   1  Nisha  20.0        NaN  35000.0   2020-01-01
1   2    NaN   NaN         HR      NaN   2020-01-02
2   3   Amit  20.0         IT  35000.0   2020-01-03
3   4    NaN  25.0        NaN  35000.0   2020-01-04
4   5    NaN  20.0        NaN  30000.0   2020-01-05

In [75]:
df7=df.groupby("Department")["Salary"].sum()

In [76]:
df7

Department
Finance     645000.0
HR         1010000.0
IT          900000.0
Name: Salary, dtype: float64

In [77]:
df.isnull().sum()

ID               0
Name            64
Age             34
Department      92
Salary          48
Joining_Date     0
dtype: int64

In [78]:
df8=df.fillna("Uknown")
df8

      ID    Name     Age Department   Salary Joining_Date
0      1   Nisha    20.0     Uknown  35000.0   2020-01-01
1      2  Uknown  Uknown         HR   Uknown   2020-01-02
2      3    Amit    20.0         IT  35000.0   2020-01-03
3      4  Uknown    25.0     Uknown  35000.0   2020-01-04
4      5  Uknown    20.0     Uknown  30000.0   2020-01-05
..   ...     ...     ...        ...      ...          ...
195  196    Amit    21.0     Uknown  25000.0   2020-07-14
196  197   Priya    22.0         HR   Uknown   2020-07-15
197  198   Nisha    21.0         HR   Uknown   2020-07-16
198  199    Amit    20.0         HR  40000.0   2020-07-17
199  200  Uknown    24.0     Uknown  30000.0   2020-07-18

[200 rows x 6 columns]

In [79]:
df.head()

   ID   Name   Age Department   Salary Joining_Date
0   1  Nisha  20.0        NaN  35000.0   2020-01-01
1   2    NaN   NaN         HR      NaN   2020-01-02
2   3   Amit  20.0         IT  35000.0   2020-01-03
3   4    NaN  25.0        NaN  35000.0   2020-01-04
4   5    NaN  20.0        NaN  30000.0   2020-01-05

In [80]:
import numpy as np
s=pd.Series([np.nan,np.nan,np.nan,np.nan,np.nan,np.nan],index=df.columns)
s

ID             NaN
Name           NaN
Age            NaN
Department     NaN
Salary         NaN
Joining_Date   NaN
dtype: float64

In [84]:
conc=pd.concat([df,s.to_frame().T])
conc.tail()

        ID   Name   Age Department   Salary Joining_Date
196  197.0  Priya  22.0         HR      NaN   2020-07-15
197  198.0  Nisha  21.0         HR      NaN   2020-07-16
198  199.0   Amit  20.0         HR  40000.0   2020-07-17
199  200.0    NaN  24.0        NaN  30000.0   2020-07-18
0      NaN    NaN   NaN        NaN      NaN          NaN

In [87]:
dropped=conc.dropna(how="all")
dropped.tail()

        ID   Name   Age Department   Salary Joining_Date
195  196.0   Amit  21.0        NaN  25000.0   2020-07-14
196  197.0  Priya  22.0         HR      NaN   2020-07-15
197  198.0  Nisha  21.0         HR      NaN   2020-07-16
198  199.0   Amit  20.0         HR  40000.0   2020-07-17
199  200.0    NaN  24.0        NaN  30000.0   2020-07-18

In [96]:
df9=df.dropna(thresh=2)
df9

      ID   Name   Age Department   Salary Joining_Date
0      1  Nisha  20.0        NaN  35000.0   2020-01-01
1      2    NaN   NaN         HR      NaN   2020-01-02
2      3   Amit  20.0         IT  35000.0   2020-01-03
3      4    NaN  25.0        NaN  35000.0   2020-01-04
4      5    NaN  20.0        NaN  30000.0   2020-01-05
..   ...    ...   ...        ...      ...          ...
195  196   Amit  21.0        NaN  25000.0   2020-07-14
196  197  Priya  22.0         HR      NaN   2020-07-15
197  198  Nisha  21.0         HR      NaN   2020-07-16
198  199   Amit  20.0         HR  40000.0   2020-07-17
199  200    NaN  24.0        NaN  30000.0   2020-07-18

[200 rows x 6 columns]

In [97]:
df.dropna(subset=["Name","Age"])

      ID   Name   Age Department   Salary Joining_Date
0      1  Nisha  20.0        NaN  35000.0   2020-01-01
2      3   Amit  20.0         IT  35000.0   2020-01-03
5      6  Priya  21.0        NaN  40000.0   2020-01-06
8      9   Amit  25.0    Finance  30000.0   2020-01-09
10    11  Nisha  22.0         HR  25000.0   2020-01-11
..   ...    ...   ...        ...      ...          ...
194  195    Raj  21.0        NaN  35000.0   2020-07-13
195  196   Amit  21.0        NaN  25000.0   2020-07-14
196  197  Priya  22.0         HR      NaN   2020-07-15
197  198  Nisha  21.0         HR      NaN   2020-07-16
198  199   Amit  20.0         HR  40000.0   2020-07-17

[114 rows x 6 columns]

In [98]:
df.head()

   ID   Name   Age Department   Salary Joining_Date
0   1  Nisha  20.0        NaN  35000.0   2020-01-01
1   2    NaN   NaN         HR      NaN   2020-01-02
2   3   Amit  20.0         IT  35000.0   2020-01-03
3   4    NaN  25.0        NaN  35000.0   2020-01-04
4   5    NaN  20.0        NaN  30000.0   2020-01-05

In [101]:
df[["Name","Age"]].dropna()

      Name   Age
0    Nisha  20.0
2     Amit  20.0
5    Priya  21.0
8     Amit  25.0
10   Nisha  22.0
..     ...   ...
194    Raj  21.0
195   Amit  21.0
196  Priya  22.0
197  Nisha  21.0
198   Amit  20.0

[114 rows x 2 columns]

In [102]:
df.sort_values(by=["Salary","Age"],ascending=[True,False])

      ID   Name   Age Department   Salary Joining_Date
100  101    NaN  25.0        NaN  25000.0   2020-04-10
128  129   Amit  25.0        NaN  25000.0   2020-05-08
131  132    NaN  25.0         HR  25000.0   2020-05-11
153  154    NaN  25.0    Finance  25000.0   2020-06-02
27    28    Raj  24.0        NaN  25000.0   2020-01-28
..   ...    ...   ...        ...      ...          ...
119  120  Nisha   NaN        NaN      NaN   2020-04-29
141  142  Priya   NaN        NaN      NaN   2020-05-21
144  145   Amit   NaN        NaN      NaN   2020-05-24
147  148    NaN   NaN        NaN      NaN   2020-05-27
152  153   Amit   NaN         IT      NaN   2020-06-01

[200 rows x 6 columns]

In [103]:
df.head()

   ID   Name   Age Department   Salary Joining_Date
0   1  Nisha  20.0        NaN  35000.0   2020-01-01
1   2    NaN   NaN         HR      NaN   2020-01-02
2   3   Amit  20.0         IT  35000.0   2020-01-03
3   4    NaN  25.0        NaN  35000.0   2020-01-04
4   5    NaN  20.0        NaN  30000.0   2020-01-05

In [104]:
df["Age"].sort_values()

0      20.0
2      20.0
4      20.0
11     20.0
16     20.0
       ...
151     NaN
152     NaN
159     NaN
167     NaN
169     NaN
Name: Age, Length: 200, dtype: float64

In [107]:
df10=df.rename(columns={"Name":"Name_here"})
df10.head()

   ID Name_here   Age Department   Salary Joining_Date
0   1     Nisha  20.0        NaN  35000.0   2020-01-01
1   2       NaN   NaN         HR      NaN   2020-01-02
2   3      Amit  20.0         IT  35000.0   2020-01-03
3   4       NaN  25.0        NaN  35000.0   2020-01-04
4   5       NaN  20.0        NaN  30000.0   2020-01-05

In [109]:
df.to_json("sample_with_nan_values.json",orient="records")

In [112]:
import pandas as pd
import os
os.getcwd()
df=''
for file in os.listdir():
    if file.endswith(".csv"):
    df=pd.read_csv("product_batch_with_nan.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Batch_ID            300 non-null    int64
 1   Product_Name        212 non-null    object
 2   Price               252 non-null    float64
 3   Quantity            237 non-null    float64
 4   Manufacturing_Date  300 non-null    object
 5   Expiry_Date         300 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 14.2+ KB

In [113]:
df.describe()

         Batch_ID       Price    Quantity
count  300.000000  252.000000  237.000000
mean   150.500000  114.583333    7.147679
std     86.746758   54.142399    6.856220
min      1.000000   50.000000    1.000000
25%     75.750000   75.000000    2.000000
50%    150.500000  100.000000    5.000000
75%    225.250000  150.000000   10.000000
max    300.000000  200.000000   20.000000

In [114]:
df.shape

(300, 6)

In [115]:
df.size

1800

In [116]:
df.ndim

2

In [120]:
df.nunique()

Batch_ID              300
Product_Name            5
Price                   5
Quantity                5
Manufacturing_Date    300
Expiry_Date           300
dtype: int64

In [121]:
df["Price"].unique

<bound method Series.unique of 0      100.0
1       75.0
2      100.0
3      100.0
4      150.0
       ...
295     75.0
296    100.0
297     50.0
298     75.0
299      NaN
Name: Price, Length: 300, dtype: float64>

In [122]:
df.dtypes

Batch_ID                int64
Product_Name           object
Price                 float64
Quantity              float64
Manufacturing_Date     object
Expiry_Date            object
dtype: object

In [123]:
df["Price"].array

<NumpyExtensionArray>
[np.float64(100.0),  np.float64(75.0), np.float64(100.0), np.float64(100.0),
 np.float64(150.0), np.float64(150.0),  np.float64(50.0),  np.float64(50.0),
  np.float64(75.0),  np.float64(50.0),
 ...
 np.float64(150.0), np.float64(200.0),  np.float64(75.0),   np.float64(nan),
 np.float64(100.0),  np.float64(75.0), np.float64(100.0),  np.float64(50.0),
  np.float64(75.0),   np.float64(nan)]
Length: 300, dtype: float64

In [124]:
df.columns

Index(['Batch_ID', 'Product_Name', 'Price', 'Quantity', 'Manufacturing_Date',
       'Expiry_Date'],
      dtype='object')

In [125]:
df.index

RangeIndex(start=0, stop=300, step=1)

In [126]:
df.head()

   Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
0         1          NaN  100.0       2.0         2023-01-01  2024-01-01
1         2          Oil   75.0       2.0         2023-01-02  2024-01-02
2         3        Cream  100.0       2.0         2023-01-03  2024-01-03
3         4          NaN  100.0      20.0         2023-01-04  2024-01-04
4         5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05

In [128]:
df1=df["Price"]==75
df[df1].head()

    Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
1          2          Oil   75.0       2.0         2023-01-02  2024-01-02
8          9         Soap   75.0       2.0         2023-01-09  2024-01-09
14        15          Oil   75.0      10.0         2023-01-15  2024-01-15
16        17          NaN   75.0       NaN         2023-01-17  2024-01-17
19        20          Oil   75.0      10.0         2023-01-20  2024-01-20

In [136]:
df2=df[df["Price"]==75]
df2[["Product_Name"]].dropna()

    Product_Name
1            Oil
8           Soap
14           Oil
19           Oil
24         Cream
54       Shampoo
121      Shampoo
123      Shampoo
125          Oil
128   Toothpaste
130   Toothpaste
132      Shampoo
133   Toothpaste
134        Cream
141      Shampoo
142          Oil
144      Shampoo
148        Cream
159   Toothpaste
160      Shampoo
168      Shampoo
173          Oil
193   Toothpaste
201      Shampoo
202        Cream
204          Oil
211   Toothpaste
212         Soap
214          Oil
227   Toothpaste
243      Shampoo
251         Soap
252   Toothpaste
256      Shampoo
258      Shampoo
259         Soap
261          Oil
266      Shampoo
272         Soap
292   Toothpaste
295   Toothpaste
298   Toothpaste

In [137]:
df3=df[df["Product_Name"]=="Oil"]
df3[["Price","Quantity"]]

     Price  Quantity
1     75.0       2.0
14    75.0      10.0
19    75.0      10.0
23    50.0       5.0
26   200.0      10.0
30   100.0       NaN
37   200.0      20.0
38    50.0       1.0
45   200.0       5.0
47   200.0       1.0
57   100.0      10.0
59    50.0       2.0
67   100.0       NaN
68    50.0      10.0
70   150.0       1.0
72   100.0       NaN
78   200.0       5.0
80   100.0       5.0
86   200.0       2.0
92     NaN       NaN
96    50.0       5.0
102  200.0      20.0
112    NaN      10.0
113  100.0      20.0
114  150.0      10.0
125   75.0       NaN
139  200.0      20.0
142   75.0       1.0
150  150.0       NaN
173   75.0       1.0
179   50.0      10.0
181  150.0       2.0
190  100.0       NaN
196  200.0       1.0
204   75.0      20.0
205    NaN       5.0
206  200.0       NaN
207   50.0      20.0
208  150.0       2.0
214   75.0      20.0
224    NaN       5.0
237  200.0       1.0
242  150.0       NaN
247   50.0       NaN
248  200.0       NaN
261   75.0       NaN
271  150.0      20.0
275   50.0       2.0
283   50.0       5.0
291  200.0       5.0
296  100.0       2.0
297   50.0       2.0
299    NaN      20.0

In [138]:
df.head()

   Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
0         1          NaN  100.0       2.0         2023-01-01  2024-01-01
1         2          Oil   75.0       2.0         2023-01-02  2024-01-02
2         3        Cream  100.0       2.0         2023-01-03  2024-01-03
3         4          NaN  100.0      20.0         2023-01-04  2024-01-04
4         5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05

In [139]:
df4=df["Quantity"].sum()

In [140]:
df4

np.float64(1694.0)

In [141]:
df5=df.groupby("Product_Name")["Quantity"].sum()
df5

Product_Name
Cream         179.0
Oil           328.0
Shampoo       261.0
Soap          173.0
Toothpaste    276.0
Name: Quantity, dtype: float64

In [142]:
df6=df.groupby("Product_Name")["Quantity"].mean()
df6

Product_Name
Cream         5.966667
Oil           8.000000
Shampoo       6.365854
Soap          5.965517
Toothpaste    8.625000
Name: Quantity, dtype: float64

In [143]:
df7=df.rename(columns={"Manufacturing_Date":"MFD","Expiry_Date":"EXD"})
df7.head()

   Batch_ID Product_Name  Price  Quantity         MFD         EXD
0         1          NaN  100.0       2.0  2023-01-01  2024-01-01
1         2          Oil   75.0       2.0  2023-01-02  2024-01-02
2         3        Cream  100.0       2.0  2023-01-03  2024-01-03
3         4          NaN  100.0      20.0  2023-01-04  2024-01-04
4         5   Toothpaste  150.0       2.0  2023-01-05  2024-01-05

In [146]:
df.isnull().sum()

Batch_ID               0
Product_Name          88
Price                 48
Quantity              63
Manufacturing_Date     0
Expiry_Date            0
dtype: int64

In [147]:
df8=df.fillna("NONE")
df8.head()

   Batch_ID Product_Name  Price Quantity Manufacturing_Date Expiry_Date
0         1         NONE  100.0      2.0         2023-01-01  2024-01-01
1         2          Oil   75.0      2.0         2023-01-02  2024-01-02
2         3        Cream  100.0      2.0         2023-01-03  2024-01-03
3         4         NONE  100.0     20.0         2023-01-04  2024-01-04
4         5   Toothpaste  150.0      2.0         2023-01-05  2024-01-05

In [148]:
df9=df.dropna()
df9.head()

   Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
1         2          Oil   75.0       2.0         2023-01-02  2024-01-02
2         3        Cream  100.0       2.0         2023-01-03  2024-01-03
4         5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05
5         6        Cream  150.0       5.0         2023-01-06  2024-01-06
6         7        Cream   50.0       1.0         2023-01-07  2024-01-07

In [149]:
df10=df.dropna(subset=["Price","Quantity"])
df10

     Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
0           1          NaN  100.0       2.0         2023-01-01  2024-01-01
1           2          Oil   75.0       2.0         2023-01-02  2024-01-02
2           3        Cream  100.0       2.0         2023-01-03  2024-01-03
3           4          NaN  100.0      20.0         2023-01-04  2024-01-04
4           5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05
..        ...          ...    ...       ...                ...         ...
294       295        Cream  100.0       2.0         2023-10-22  2024-10-21
295       296   Toothpaste   75.0      20.0         2023-10-23  2024-10-22
296       297          Oil  100.0       2.0         2023-10-24  2024-10-23
297       298          Oil   50.0       2.0         2023-10-25  2024-10-24
298       299   Toothpaste   75.0       2.0         2023-10-26  2024-10-25

[200 rows x 6 columns]

In [150]:
import numpy as np
ser=pd.Series([np.nan,np.nan,np.nan,np.nan,np.nan,np.nan],index=df.columns)
ser

Batch_ID             NaN
Product_Name         NaN
Price                NaN
Quantity             NaN
Manufacturing_Date   NaN
Expiry_Date          NaN
dtype: float64

In [151]:
concat_data=pd.concat([df,ser.to_frame().T])
concat_data.tail()

     Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
296     297.0          Oil  100.0       2.0         2023-10-24  2024-10-23
297     298.0          Oil   50.0       2.0         2023-10-25  2024-10-24
298     299.0   Toothpaste   75.0       2.0         2023-10-26  2024-10-25
299     300.0          Oil    NaN      20.0         2023-10-27  2024-10-26
0         NaN          NaN    NaN       NaN                NaN         NaN

In [153]:
concat_data.dropna(how="all").tail()

     Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
295     296.0   Toothpaste   75.0      20.0         2023-10-23  2024-10-22
296     297.0          Oil  100.0       2.0         2023-10-24  2024-10-23
297     298.0          Oil   50.0       2.0         2023-10-25  2024-10-24
298     299.0   Toothpaste   75.0       2.0         2023-10-26  2024-10-25
299     300.0          Oil    NaN      20.0         2023-10-27  2024-10-26

Har column me kitni NaN values hain, ye count karo.

In [158]:
df.isnull().sum()

Batch_ID               0
Product_Name          88
Price                 48
Quantity              63
Manufacturing_Date     0
Expiry_Date            0
dtype: int64

Average price nikalna (NaN ko ignore karke).

In [159]:
df11=df["Price"].dropna().mean()
df11

np.float64(114.58333333333333)

In [160]:
df12=df["Price"].dropna().agg(["mean","min","max"])
df12

mean    114.583333
min      50.000000
max     200.000000
Name: Price, dtype: float64

Sirf un rows ko print karo jaha Price 100 se zyada ho.

In [163]:
df13=df[df["Price"]>100]
df13.head()

    Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
4          5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05
5          6        Cream  150.0       5.0         2023-01-06  2024-01-06
11        12   Toothpaste  150.0       NaN         2023-01-12  2024-01-12
15        16   Toothpaste  200.0       1.0         2023-01-16  2024-01-16
18        19         Soap  150.0       1.0         2023-01-19  2024-01-19

Sirf Shampoo wale products ke Quantity ka average nikalna.

In [174]:
df14=df[df["Product_Name"]=="Shampoo"]
df14["Quantity"].mean()

np.float64(6.365853658536586)

Wo products list karo jinki Manufacturing_Date 2023-05-01 ke baad hai.

In [176]:
df15=df[df["Manufacturing_Date"]>"2023-05-01"]
df15["Product_Name"].head()

121    Shampoo
122        NaN
123    Shampoo
124    Shampoo
125        Oil
Name: Product_Name, dtype: object

Wo products list karo jinka Expiry_Date 2024-05-01 se pehle hai.

In [178]:
df16=df[df["Expiry_Date"]<"2024-05-01"]
df16["Product_Name"]

0             NaN
1             Oil
2           Cream
3             NaN
4      Toothpaste
          ...
116       Shampoo
117         Cream
118           NaN
119         Cream
120       Shampoo
Name: Product_Name, Length: 121, dtype: object

Har product ka total quantity batao.
Har product ka average price batao.

In [180]:
df17=df.groupby("Product_Name")["Quantity"].agg(["max","min","mean","sum"])
df17

               max  min      mean    sum
Product_Name
Cream         20.0  1.0  5.966667  179.0
Oil           20.0  1.0  8.000000  328.0
Shampoo       20.0  1.0  6.365854  261.0
Soap          20.0  1.0  5.965517  173.0
Toothpaste    20.0  1.0  8.625000  276.0

Price ke according ascending order me sort karo.

Quantity ke according descending order me sort karo.

In [182]:
df18=df.sort_values(by=["Price","Quantity"],ascending=[True,False])
df18

     Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
145       146          NaN   50.0      20.0         2023-05-26  2024-05-25
171       172         Soap   50.0      20.0         2023-06-21  2024-06-20
207       208          Oil   50.0      20.0         2023-07-27  2024-07-26
220       221      Shampoo   50.0      20.0         2023-08-09  2024-08-08
7           8          NaN   50.0      10.0         2023-01-08  2024-01-08
..        ...          ...    ...       ...                ...         ...
203       204          NaN    NaN       NaN         2023-07-23  2024-07-22
218       219      Shampoo    NaN       NaN         2023-08-07  2024-08-06
232       233          NaN    NaN       NaN         2023-08-21  2024-08-20
254       255        Cream    NaN       NaN         2023-09-12  2024-09-11
280       281          NaN    NaN       NaN         2023-10-08  2024-10-07

[300 rows x 6 columns]

NaN values ko default value (Price = 0, Quantity = 0, Product_Name = "Unknown") se fill karo.

In [191]:
df["Product_Name"].fillna("Unknown")

0         Unknown
1             Oil
2           Cream
3         Unknown
4      Toothpaste
          ...
295    Toothpaste
296           Oil
297           Oil
298    Toothpaste
299           Oil
Name: Product_Name, Length: 300, dtype: object

In [192]:
df["Price"].fillna(0)

0      100.0
1       75.0
2      100.0
3      100.0
4      150.0
       ...
295     75.0
296    100.0
297     50.0
298     75.0
299      0.0
Name: Price, Length: 300, dtype: float64

In [193]:
df["Quantity"].fillna(0)

0       2.0
1       2.0
2       2.0
3      20.0
4       2.0
       ...
295    20.0
296     2.0
297     2.0
298     2.0
299    20.0
Name: Quantity, Length: 300, dtype: float64

In [195]:
df.head()

   Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
0         1          NaN  100.0       2.0         2023-01-01  2024-01-01
1         2          Oil   75.0       2.0         2023-01-02  2024-01-02
2         3        Cream  100.0       2.0         2023-01-03  2024-01-03
3         4          NaN  100.0      20.0         2023-01-04  2024-01-04
4         5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05

In [196]:
df.fillna({"Price":0,
           "Quantity":0,
           "Product_Name":"Unknown"},inplace=True)

In [198]:
df.head(10)

   Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
0         1      Unknown  100.0       2.0         2023-01-01  2024-01-01
1         2          Oil   75.0       2.0         2023-01-02  2024-01-02
2         3        Cream  100.0       2.0         2023-01-03  2024-01-03
3         4      Unknown  100.0      20.0         2023-01-04  2024-01-04
4         5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05
5         6        Cream  150.0       5.0         2023-01-06  2024-01-06
6         7        Cream   50.0       1.0         2023-01-07  2024-01-07
7         8      Unknown   50.0      10.0         2023-01-08  2024-01-08
8         9         Soap   75.0       2.0         2023-01-09  2024-01-09
9        10   Toothpaste   50.0       0.0         2023-01-10  2024-01-10

Pehli 10 rows ka sirf Product_Name, Price, aur Quantity print karo.

In [200]:
df19=df[df["Product_Name","Price","Quantity"]]
df19

KeyError: ('Product_Name', 'Price', 'Quantity')

In [204]:
df.loc[0:9,["Product_Name","Price","Quantity"]]

  Product_Name  Price  Quantity
0      Unknown  100.0       2.0
1          Oil   75.0       2.0
2        Cream  100.0       2.0
3      Unknown  100.0      20.0
4   Toothpaste  150.0       2.0
5        Cream  150.0       5.0
6        Cream   50.0       1.0
7      Unknown   50.0      10.0
8         Soap   75.0       2.0
9   Toothpaste   50.0       0.0

Batch_ID 50 se 60 ke beech ka data show karo.

In [205]:
df.loc[50:60]

    Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
50        51        Cream   50.0       0.0         2023-02-20  2024-02-20
51        52   Toothpaste    0.0       1.0         2023-02-21  2024-02-21
52        53      Unknown   75.0       5.0         2023-02-22  2024-02-22
53        54        Cream  200.0      10.0         2023-02-23  2024-02-23
54        55      Shampoo   75.0       1.0         2023-02-24  2024-02-24
55        56      Unknown   75.0      10.0         2023-02-25  2024-02-25
56        57         Soap  200.0      20.0         2023-02-26  2024-02-26
57        58          Oil  100.0      10.0         2023-02-27  2024-02-27
58        59      Shampoo    0.0       5.0         2023-02-28  2024-02-28
59        60          Oil   50.0       2.0         2023-03-01  2024-02-29
60        61      Unknown  150.0       0.0         2023-03-02  2024-03-01

Sirf wo products select karo jaha Price > 100 aur Quantity > 5 ho.

In [207]:
df21=df[(df["Price"]>100) & (df["Quantity"]>5)]
df21.head()

    Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
26        27          Oil  200.0      10.0         2023-01-27  2024-01-27
37        38          Oil  200.0      20.0         2023-02-07  2024-02-07
43        44      Unknown  200.0      20.0         2023-02-13  2024-02-13
53        54        Cream  200.0      10.0         2023-02-23  2024-02-23
56        57         Soap  200.0      20.0         2023-02-26  2024-02-26

Sirf wo rows print karo jaha Product_Name NaN ya None hai.

In [209]:
df22=df["Product_Name"]=="NaN"
df[df22]

Empty DataFrame
Columns: [Batch_ID, Product_Name, Price, Quantity, Manufacturing_Date, Expiry_Date]
Index: []

In [211]:
df23=df["Product_Name"].isna()
df[df23]

Empty DataFrame
Columns: [Batch_ID, Product_Name, Price, Quantity, Manufacturing_Date, Expiry_Date]
Index: []

Cleaned data ko cleaned_product_batch.csv naam ki file me save karo.

In [213]:
df.head()

   Batch_ID Product_Name  Price  Quantity Manufacturing_Date Expiry_Date
0         1      Unknown  100.0       2.0         2023-01-01  2024-01-01
1         2          Oil   75.0       2.0         2023-01-02  2024-01-02
2         3        Cream  100.0       2.0         2023-01-03  2024-01-03
3         4      Unknown  100.0      20.0         2023-01-04  2024-01-04
4         5   Toothpaste  150.0       2.0         2023-01-05  2024-01-05

In [214]:
df.to_csv("cleaned_data.csv",index=False)

In [157]:
import pandas as pd
filename="product_batch_with_nan.csv"
chunk_size=50
revenue=0
for chunk in pd.read_csv(filename,chunksize=chunk_size):
    chunk["Total"]=chunk["Price"]*chunk["Quantity"]
    revenue+=chunk["Total"].sum()
    print("Current revenue is:",revenue)
print("Total revenue is:",revenue)

Current revenue is: 25075.0
Current revenue is: 50450.0
Current revenue is: 85225.0
Current revenue is: 125100.0
Current revenue is: 144450.0
Current revenue is: 173925.0
Total revenue is: 173925.0